{
  "goals": [
    "Build a highly-functional demo prototype.",
    "Allow users with valid receipts to return items to retail locations."
  ],
  "inputs": [
    "ASCII diagrams of layouts and flows",
    "PNG/JPEG screenshots of page sketches",
    "PDF flowcharts of transaction phases",
    "Written specs for phases, cards, tiles, and stage behavior",
    "Dummy item and receipt data for testing"
  ],
  "constraints": [
    "Derived values are not stored in state; they are recalculated on re-render.",
    "In general, users can move backwards and forwards through phases freely, although this movement can be conditionally restricted.",
    "Advancing a phase always triggers validation and cleanup.",
    "Interactions within a Stage never close the Stage; only outside interactions close it.",
    "Only one ActorTile may be Solo within a given context at a time.",
    "Adding items: Item number must exist in database (fttb: 1122 and 1133).",
    "Item quantity must be >0 when creating, but can be set to 0 after creation.",
    "Receipts must be numeric IDs only.",
    "Items without valid receipts are expelled in cleanup.",
    "Refund total always reflects only matched items (intersection of return items and receipted items)."
  ],
  "outputs": [
    "Working React components implementing the spec",
    "Structured spec files (YAML/Markdown) capturing design intent",
    "ASCII diagrams representing layout and flow"
  ],
  "definitions": {
    "Stage": "Container inside a Card where ActorTiles live. One ActorTile can expand to fill it (Solo).",
    "ActorTile (AT)": "UI unit placed in a Stage. Can be normal or Solo. Only one Solo allowed per context.",
    "Solo": "State where an ActorTile fills the Stage, covering other tiles. Original header remains visible.",
    "Card": "UI container, usually with an Identifier on the left and a Stage or fields on the right.",
    "Identifier": "Key label of a Card, typically at top-left.",
    "Rechimp": "Instruction to restate understanding in own words for clarity.",
    "Encrapsulate": "Toggle to render app in intentionally low-res demo styling, to avoid over-polish.",
    "Fingerbang": "Measure of how suitable an element is for touch input (large enough for ape fingers).",
    "Drop In vs Replace": "Drop In means add files to a folder; Replace means clear folder first then add.",
    ">>": "Signal from user meaning 'proceed'."
  },
  "openIssues": [
    "Whether Stage should be a standalone component or just a container inside Card.",
    "Whether multiple ActorTiles can be Solo across different Cards at the same time, or only one Solo allowed globally.",
    "Final placement of the Continue button — always in Footer of Main Column, or context-dependent.",
    "How ad hoc navigation nodes (like Manager Approval) are added and displayed in the Nav Bar.",
    "Whether derived values like matched items should be recalculated synchronously or batched for performance.",
    "Where exactly state should live for Solo behavior — Phase level or App level.",
    "Whether Cleanup should always be a separate page or sometimes an overlay/modal.",
    "How advanced receipt search will work beyond numeric ID input.",
    "Whether Card identifiers always remain visible when their ActorTile is Solo.",
    "Exact styling defaults (tile sizes, spacing, touch targets) remain provisional."
  ]
}